src/MTO_ThermalFluid/app/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
|  turbulenceProperties
|  Set simulationType laminar; for laminar flow (e.g. baseline validation)
|  Set simulationType RAS; for k-omega SST turbulence
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
simulationType RAS;
//simulationType laminar;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     off;
    // Curvature correction: use kOmegaSSTCC when library is built (see docs)
    // kOmegaSSTCoeffs
    // {
    //     curvatureCorrection on;  // Spalart-Shur fr1 when available
    // }
}


// ************************************************************************* //
