src/MTO_ThermalFluid/app/0/ka
/*--------------------------------*- C++ -*----------------------------------*\
|  Adjoint turbulent kinetic energy (created when adjoint turbulence active)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ka;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    Wall
    {
        type            zeroGradient;
    }
    right
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
