src/MTO_ThermalFluid/app/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
|  Turbulent specific dissipation for kOmegaSST
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
    }

    Wall
    {
        type            omegaWallFunction;
        value           uniform 1;
    }

    right
    {
        type            symmetry;
    }

    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
